#+title: 数据结构与算法之美笔记

** 例题
   [[https://leetcode-cn.com/tag/array/][数组练习题]]

   [[https://leetcode-cn.com/problems/two-sum/][two-sum]]
   #+BEGIN_SRC swift
     class Solution {
         func twoSum(_ nums: [Int], _ target: Int) -> [Int] {
             var hash = [Int: Int]()
             for (idx, num) in nums.enumerated() {
                 let complement = target - num
                 if let find = hash[complement], find != idx {
                     return [idx, find]
                 }
                 hash[num] = idx
             }
             return []
         }
     }

     let result = Solution().twoSum([2,7,11,15], 9)
     let ans = [1, 0]
     print("result: \(result), ans: \(ans) ", result == ans ? "passed!" : "failed")
   #+END_SRC

   #+RESULTS:
   : result: [1, 0], ans: [1, 0]  passed!

   [[https://leetcode-cn.com/problems/3sum/][three-sum]]
   #+BEGIN_SRC swift
     class Solution {
         func threeSum_bruteForce(_ nums: [Int]) -> [[Int]] {
             var ans = [[Int]]()
             let n = nums.count
             for i in (0..<n - 2)  {
                 for j in (i + 1)..<n - 1 {
                     for k in (j + 1)..<n {
                         if (nums[i] + nums[j] + nums[k] == 0) {
                             ans.append([nums[i], nums[j], nums[k]])
                         }
                     }
                 }
             }
             return ans
         }

         func threeSum(_ nums: [Int]) -> [[Int]] {
             if nums.count < 3 { return [] }
             var result = [[Int]]()
             let nums = nums.sorted()
             let count = nums.count
             for i in 0..<count {
                 if nums[i] > 0 { return result }
                 if i > 0 && nums[i] == nums[i - 1] { continue }
                 var l = i + 1
                 var r = count - 1
                 while l < r {
                     if (nums[i] + nums[l] + nums[r] == 0) {
                         result.append([nums[i], nums[l], nums[r]])
                         while l < r && nums[l] == nums[l + 1] {
                             l += 1
                         }
                         while l < r && nums[r] == nums[r - 1] {
                             r -= 1
                         }
                         l += 1
                         r -= 1
                     } else if (nums[i] + nums[l] + nums[r] > 0) {
                         r -= 1
                     } else {
                         l += 1
                     }
                 }
             }
             return result
         }
     }

     let result = Solution().threeSum([-1, 0, 1, 2, -1, 4])
     let ans = [[-1, -1, 2], [-1, 0, 1]]
     print("result: \(result), ans: \(ans)", result == ans ? "passed!" : "failued")
   #+END_SRC

   #+RESULTS:
   : result: [[-1, -1, 2], [-1, 0, 1]], ans: [[-1, -1, 2], [-1, 0, 1]] passed!


   [[https://leetcode-cn.com/problems/remove-duplicates-from-sorted-array/][删除数组中的重复项]]
   #+BEGIN_SRC swift
     class Solution {
         func removeDuplicates(_ nums: inout [Int]) -> Int {
             if nums.isEmpty { return 0 }
             var i = 0
             for j in 1..<nums.count {
                 if nums[i] != nums[j] {
                     i += 1
                     nums[i] = nums[j]
                 }
             }
             return i + 1
         }
     }

     var elements = [0,0,1,1,1,2,2,3,3,4]
     let result = Solution().removeDuplicates(&elements)
     let ans = 5
     print("result: \(result), ans: \(ans)", result == ans ? "passed!": "failed")
   #+END_SRC

   #+RESULTS:
   : result: 5, ans: 5 passed!

*** 有效的括号
    #+NAME: valid-parentheses
    #+BEGIN_SRC swift
      class Solution {
          func isValid(_ s: String) -> Bool {
              var stack = [Character]()
              for char in Array(s) {
                  switch char {
                  case "(": stack.append(")")
                  case "[": stack.append("]")
                  case "{": stack.append("}")
                  default:
                      if stack.isEmpty || char != stack.removeLast() {
                          return false
                      }
                  }
              }
              return stack.isEmpty
          }
      }
    #+END_SRC
    
    #+NAME: valid-parentheses-tests
    #+BEGIN_SRC swift :noweb yes
      <<valid-parentheses>>
      func test(_ cases: [String], _ ans: [Bool]) {
          for pair in zip(cases, ans) {
              let result = Solution().isValid(pair.0) == pair.1 ? "passed" : "failed"
              print("for case \"\(pair.0)\" " + result)
          }
      }

      let cases = [" ", "()", "{]", "()[]{}", "([)]"]
      let ans = [false, true, false, true, false]

      test(cases, ans)
    #+END_SRC

    #+RESULTS: valid-parentheses-tests
    : for case " " passed
    : for case "()" passed
    : for case "{]" passed
    : for case "()[]{}" passed
    : for case "([)]" passed
*** 最小栈                                                           :单调栈:
    :PROPERTIES:
    :LEETCODE_ID: 155
    :DIFFICULTY: easy
    :END:
    #+NAME: min-stack
    #+BEGIN_SRC swift
      class MinStack {
          private var store = [Int]()
          private var min = [Int]()

          init() {}

          func push(_ x: Int) {
              store.append(x)
              if min.isEmpty || x <= (min.last ?? 0) {
                  min.append(x)
              }
          }

          func pop() {
              if store.isEmpty { return }
              let popped = store.popLast()
              if popped == min.last {
                 _ = min.popLast()
              }
          }

          func top() -> Int {
              guard let top = store.last else { fatalError() }
              return top
          }

          func getMin() -> Int {
              guard let top = min.last else { fatalError() }
              return top
          }
      }

      var result = [String]()
      let expected = ["true", "0", "-2"]
      var minStack = MinStack()
      minStack.push(-2)
      minStack.push(0)
      minStack.push(-3)
      result.append("\(minStack.getMin() == -3)")
      minStack.pop()
      result.append("\(minStack.top())")
      result.append("\(minStack.getMin())")
      print("expected: \(expected), result: \(result)", (result == expected ? "passed" : "failued"))
    #+END_SRC

    #+RESULTS: min-stack
    : expected: ["true", "0", "-2"], result: ["true", "0", "-2"] passed
